Tekla Open API Reference for Tekla Structures 2025
AnalysisPartLoadingProperties Constructor
Initializes a new instance of the AnalysisPartLoadingProperties class
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartLoadingProperties()
Public Sub New
See Also
Reference
AnalysisPartLoadingProperties Class
Tekla.Structures.Analysis Namespace